{
    "4Runner": {
        "id": "runner",
        "title": "'08 Toyota 4Runner",
        "subtitle": "(WIP) A practical, reliable, offroad capable, daily driver for beach driving, boat hauling, and more.",
        "date" : "June, 2024 - Present",
        "discussion": "<html>    <p class='viewerBody'>        My first car was a 2001 Mazda Miata, a little convertible I happily drove around for a few years. Its novelty outweighed its drawbacks for a time; however, eventually I found myself in need of something more practical. Late in the summer of 2022, in a search for a vehicle more closely matching my lifestyle, I purchased a stock 2008 Toyota 4Runner 4WD SR5 4.0L V6 in Shadow Mica Grey.    </p>    <p class='viewerBody'>        Even stock, this mid-sized SUV carried a \"get it done\" attitude that I loved. Being four-wheel-drive, the 4Runner is capable of adventures in a multitude of environments ranging from the soft sands of the Outer Banks to the rocky trails of who-knows-where. With that said, the 4Runner is still a sort of \"family-car\" so it needed some modification to match the functionality and style I was after. This also presented a chance to practice some engineering skills.    </p>    </html>",
        "thumbnail": "runner.jpg",
        "images": [],
        "subProjects": ["hello"],
        "tags": ["Engineering", "Automotive", "Fabrication", "Overland"]
    },
    "catalina22": {
        "id" : "catalina",
        "title": "'81 Catalina 22 Sailboat",
        "subtitle": "(WIP) An overnight cruising sailboat, purchased with dreams of camping, needed a refresh.",
        "date" : "July, 2024 - Present",
        "discussion": "<p class=\"viewerBody\">Text</p>",
        "thumbnail": "c22Wing.jpg",
        "images": [],
        "subProjects": [],
        "tags": ["Engineering", "Marine", "Fabrication", "Camping", "Repairs", "Restoration", "Maintenance."]
    },
    "floater": {
        "id": "floater",
        "title": "'84 Chaparral 204 Powerboat",
        "subtitle": "Repaired, rewired, and updated an old boat for use on the sounds of the Outer Banks",
        "date" : "June, 2020 - May, 2022",
        "discussion": "<html>    <h2>TL;DR</h2>    <p class='viewerBody'>I pulled an old boat out of the bushes and fixed it up. Repairs and maintenance include:</p>    <ul class='viewerBody'>        <li>Cleaned Carburetors on motor</li>        <li>Replaced stator, trigger, switch boxes on motor (ignition system)</li>        <li>Replaced head gaskets on motor</li>        <li>Replaced water pump on motor</li>        <li>Other general outboard motor maintenance</li>        <li>Full electrical rewire of boat's 12V system:<ul>            <li>Garmin Depth Finder/Chart Plotter</li>            <li>VHF Radio</li>            <li>Navigation Lights</li>            <li>Courtesy Lights</li>            <li>Spotlights</li>            <li>Gauges</li>            <li>more...</li></ul>        </li>        <li>Woodwork refinishing</li>        <li>Bimini Top</li>        <li>Anti-fouling bottom paint</li>    </ul>    <h2>Introduction</h2>    <p class='viewerBody'>Sometime in the '90s my father purchased a 1984 Chaparral 204 powerboat. After using it almost daily for several years, the boat encountered mechanical issues that my father was not able to deal with at the time. It was finally covered in a tarp and left under some trees in 2005. It remained untouched until my mother had all but convinced him to finally donate it, sell it, or bring it to a junk yard. This is where I come in.</p>    <p class='viewerBody'>After a day at the beach, a family friend convinced me that the boat could be fixed up and be the perfect way for me to get on the water. I eventually made a deal with my parents that if I could get the motor to run then the boat could be mine.</p>    <h2>The Motor</h2>    <h3>Fuel System</h3>    <p class='viewerBody'>The motor on this boat is a 1984 Mercury Blackmax 150HP 2 Stroke V6.</p>    <p class='viewerBody'>My first instinct to fix the issues my father had originally was to clean and rebuild the three carburetors on the motor. This involved the removal of linkages, fuel lines, and bleed lines from the carburetors then unbolting them. I took pictures of the carburetors as I stripped down each layer and removed pieces including the bowls, floats, and jets. I took special care to ensure that parts for each carb stayed with that carb as the three were not identical.</p>    <p class='viewerBody'>In the same week, I cleaned and rebuilt the vacuum driven fuel pump.</p>    <h3>Pre-Sea-Trial Maintenance</h3>    <p class='viewerBody'>I did some other basic maintenance before attempting to launch the boat and test run it. Such as replacing the water pump and lubricating the steering system.</p>    <h3>First Sea-Trial</h3>    <p class='viewerBody'>The first sea-trail did not go as well as I had hoped it would. I experienced the same issue my father had when he last ran the boat: It could not run faster than 1500 RPM in gear. While that was not a desired result, the engine did start and run after fifteen years and it performed well at idle. Having cleaned the fuel system, I suspected that there was an issue in the ignition system.</p>    <h3>Ignition System</h3>    <p class='viewerBody'>The ignition system appears complicated at first; however, can be made simple with some explanation.</p>    <p class='viewerBody'>The stator generates an AC voltage by spinning magnets around a few sets of coils via the flywheel. The magnets induce a current in the coils that charges the switch boxes. Beneath the stator is a trigger that utilizes the same flywheel magnets to detect where the engine is in its rotation. At various positions corresponding with top dead center (TDC) for each cylinder, the trigger sends a pulse to the switch boxes which in turn send a high voltage signal to the ignition coil of the corresponding cylinder.</p>    <p class='viewerBody'>Following the first sea-trial, I suspected that the \"high speed\" side of the stator was bad, likely due to a past overheating issue or a past incident with the boat's battery being disconnected while the motor was running. Unable to confirm that the stator and trigger were in spec, I replaced both with cheap non-named brand parts. This is a decision I would later regret...</p>    <p class='viewerBody'>After replacing the stator and trigger, I had solved my fathers original issue and the motor ran very well. My end of the deal had been fulfilled and I could now keep the boat. It would take a couple of years for the stator to fail again on the \"low speed\" side. I would then replace it with an OEM part. I have had no issues since.</p>    <h2>The Boat</h2>    <h3>12V System</h3>    <p class='viewerBody'>The electrical system was patchwork when my dad got to it. By the time I got to it, it was a mess of wire nuts and excess wire stuffed in various places \"in case somebody needs it\". My first step with the electrical system was to tear the fire hazards out.</p>    <p class='viewerBody'>After that was handled, I began rebuilding the backbone of the system. I ran 12 AWG duplex wire to the dashboard. The ground went to a buss bar that almost all of the grounds in the boat were run to. The hot wire powers the ignition, gauges, and switch panel. The hot wire goes begins at a two-way battery switch, and the ground runs straight back to the two batteries. There is a float switch bilge pump that receives power directly from the battery. The manual switch power comes from the dash switch panel.</p>    <p class='viewerBody'>My dad could not stop talking about how he always wished he had more lights on the boat at night. Because of this, I added spotlights for dodging crab-pots and courtesy lights for finding my way inside of the boat.</p>    <p class='viewerBody'>The boat had an old Hummingbird depth finder that was showing its age in both the state of its technology and its inability to function as intended. After dealing with the old fish-finder for a couple of years I decided to upgrade. To ensure that I did not regret my choice of upgrade, I splurged a little bit and purchased a Garmin Echomap UHD 74SV. Although it hurts to spend the money in the moment, I am grateful that I got the one I really wanted every time I use it.</p>    <p class='viewerBody'>Finally, on the electronics side of things, I stole (with permission) an aging VHF radio from the family yard ornament (a different boat we're working on selling).</p>    <img style='width:70%; height:auto' src='ProjectPics/ChapDiagram.png'>    <p class='viewerBody'>*Engine wiring harness to ignition and gauges not shown</p>    <h3>Final Touches</h3>    <p class='viewerBody'>My dad had some spare time so he replaced some of the aging woodwork and refinished what remained. This just helped tidy up the look a little bit. While I was away at school, he also added a bimini top to the boat for some extra sun and rain protection.</p>    <p class='viewerBody'>As a maintenance item, I have applied two coats of anti-fouling bottom paint over the course of four years. This prevents barnacle and algae growth on the hull of the boat.</p>    <h2>Conclusion</h2>    <p class='viewerBody'>This project has been successful in getting myself out on the water in a practical way. I was fortunate to have a platform to build off of and fix up rather than to have to purchase an old boat that I would have to spend more money to fix afterwards. I have had many fun adventures on the boat with my friends and family and even if it were to only last a few more years, I'd be very happy with the time I've had with. That being said, I'll keep her kicking as long as I can.</p>    </html>",
        "thumbnail": "floater.jpg",
        "images": [],
        "subProjects": [],
        "tags": ["Engineering", "Marine", "Fabrication", "Camping", "Repairs", "Restoration", "Maintenance."]
    },
    "liftSim": {
        "id": "liftSim",
        "title": "2D Aerodynamic Simulation",
        "subtitle": "Using Euler's method and JavaFX, visually simulates projectile motion with lift and drag forces.",
        "date" : "Spring, 2023",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": "simulation.png",
        "images": [],
        "subProjects": [],
        "tags": ["Computer science", "Java", "JavaFX", "Programming", "School", "Physics", "Dynamics", "Differential Equations"]
    },
    "template": {
        "id": "",
        "title": "",
        "subtitle": "",
        "date" : "",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": "",
        "images": [],
        "subProjects": [],
        "tags": []
    }
}