{
    "compressor": {
        "id": "compressor",
        "title": "Onboard Air Compressor V0.1",
        "date" : "Spring, 2024",
        "discussion": "<h3>Introduction</h3><p class=\"viewerBody\">Onboard air is perhaps one of the most convenient upgrades that can be done to a vehicle. From filling tires, to cleaning, blowing up inflatable toys or mattresses, and saving the day in an emergency, compressed air is great tool to have around in many situations. After finding myself in need of air more than a couple of times without a convenient way to get it, I knew this was a project I wanted to take on.</p><p class=\"viewerBody\"><i>Disclaimer: This is not a tutorial. It is only documentation of my project. Attempt similar projects at your own risk!</i></p><h3>Design</h3><p class=\"viewerBody\" style='margin-bottom: 5px'>Like most DIY projects my general plan for building the onboard air compressor was to create a budget friendly solution of decent quality. An outline of the current design is as follows...</p><ul class=\"projectUl\"><li>Use a modified pre-built 12 Volt air compressor</li><li>Output manifold for compressor control and future air routing</li><li>Cooling fans to decrease wear and tear</li><li>Metal output hose to aid in cooling</li></ul><h4>Compressor</h4><p class=\"viewerBody\">I selected what is known as the <a href='https://www.napaonline.com/en/p/BK_MTWM10215C' target='none' class='emailLink' style='font-weight: 300'><u>NAPA air compressor</u></a> for this project. The Napa Air Compressor is an overseas-manufactured two cylinder 12-Volt air compressor that is sold under many names from many vendors with varying color schemes and features. These air compressors appear to all have the same construction and to be made in the same factory. I ultimately selected <a class='emailLink' style='font-weight: 300' target='none' href='https://www.amazon.com/ALL-TOP-Compressor-Cylinder-Portable-Inflator/dp/B0BXX761KQ'><u>one from Amazon</u></a> under the branding \"ALL TOP\" because it happened to be cheap at the time.</p><p class=\"viewerBody\" style='margin-bottom: 10px'>Below is a comparison of the selected compressor and the industry standard <a class='emailLink' style='font-weight: 300' target='none' href='https://store.arbusa.com/twin-motor-onboard-air-compressor-ckmta12/'><u>ARB Dual Compressor</u></a>. The values are listed as advertized on the brands' websites and have not been tested.</p><table class='projTable'><tr><th></th><th>ALL TOP</th><th>ARB</th></tr><tr><th>Free Flow Rate</th><td>12.35 CFM</td><td>6.16 CFM</td></tr><tr><th>Max Pressure</th><td>150 PSI</td><td>150 PSI</td></tr><tr><th>Duty Cycle</th><td>42% / 60 min</td><td>100%</td></tr><tr><th>Current Draw</th><td>90 A</td><td>68.6 A</td></tr><tr><th>Price</th><td>$189.99</td><td>$616.00</td></tr></table><p class=\"viewerBody\">While claims by ALL TOP are likely exaggerated, specifically the flow rate, it appeared to be a great option as long as the wiring can handle the current draw.</p><h4>System</h4><p class=\"viewerBody\">A system diagram of the current iteration of this project is shown below. The primary point of interaction between the user and the compressor is at the manifold. This is where the user plugs in an air hose and discharges the system after use. At this stage in the project, the compressor is turned on and off using the power switch from the factory located on the circuit board shroud.</p><img src='ProjectPics/compDiagram.png' class='diagram'><h4>Construction</h4><p class=\"viewerBody\">The primary problem to be solved in this project was finding a mounting solution to place the air compressor under the hood of the 4Runner and mounting a manifold for running air lines around the truck and for general management of the air system. Similar projects I found online showed people using spare battery mounting hardware as a base for their compressors. I did not feel that this was the right solution for me because I was using a larger modified compressor.</p><p class=\"viewerBody\">This is one of my first projects where I have gotten into fabrication. I made parts out of angle aluminum and aluminum sheet metal to produce a lightweight, strong, corrosion resistant solution.</p>",
        "thumbnail": "compressorMounted.jpg"
    },
    "suspension": {
        "id": "suspension",
        "title": "Suspension Upgrade",
        "date" : "Summer, 2023",
        "discussion": "<p class=\"viewerBody\">Write-up coming soon...</p>",
        "thumbnail": ""
    },
    "catRewire": {
        "id": "catRewire",
        "title": "12-Volt System Rewire",
        "date" : "Summer, 2024",
        "discussion": "<p class=\"viewerBody\">Write-up coming soon...</p>",
        "thumbnail": ""
    },
    "catPopTop": {
        "id": "catPopTop",
        "title": "Pop Top Reglass",
        "date" : "Work in progress...",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": ""
    },
    "template": {
        "id": "",
        "title": "",
        "date" : "",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": ""
    }
}