{
    "compressor": {
        "id": "compressor",
        "title": "Onboard Air Compressor (WIP)",
        "date" : "Spring, 2024",
        "discussion": "<h3>Introduction</h3><p class=\"viewerBody\">Onboard air is perhaps one of the most convenient upgrades that can be done to a vehicle. From filling tires, to cleaning, blowing up inflatable toys or mattresses, and saving the day in an emergency, compressed air is great tool to have around in many situations. After finding myself in need of air more than a couple of times without a convenient way to get it, I knew this was a project I wanted to take on.</p><p class=\"viewerBody\"><i>Disclaimer: This is not a tutorial. It is only documentation of my project. Attempt similar projects at your own risk!</i></p><h3>Design</h3><p class=\"viewerBody\" style='margin-bottom: 5px'>Like most DIY projects my general plan for building the onboard air compressor was to create a budget friendly solution of decent quality. An outline of the current design is as follows...</p><ul class=\"projectUl\"><li>Use a modified 12 Volt air compressor</li><li>Output manifold for compressor control and future air routing</li><li>Cooling fans to decrease wear and tear</li><li>Metal output hose to aid in cooling</li></ul><h4>Compressor</h4><p class=\"viewerBody\">I selected what is known as the <a href='https://www.napaonline.com/en/p/BK_MTWM10215C' target='none' class='emailLink' style='font-weight: 300'><u>NAPA air compressor</u></a> for this project. The Napa Air Compressor is an overseas-manufactured two cylinder 12-Volt air compressor that is sold under many names from many vendors with varying color schemes and features. These air compressors appear to all have the same construction and to be made in the same factory. I ultimately selected <a class='emailLink' style='font-weight: 300' target='none' href='https://www.amazon.com/ALL-TOP-Compressor-Cylinder-Portable-Inflator/dp/B0BXX761KQ'><u>one from Amazon</u></a> under the branding \"ALL TOP\" because it happened to be cheap at the time.</p><p class=\"viewerBody\" style='margin-bottom: 10px'>Below is a comparison of the selected compressor and the industry standard <a class='emailLink' style='font-weight: 300' target='none' href='https://store.arbusa.com/twin-motor-onboard-air-compressor-ckmta12/'><u>ARB Dual Compressor</u></a>. The values are listed as advertised on the brands' websites and have not been tested.</p><table class='projectTable'><tr><th></th><th>ALL TOP</th><th>ARB</th></tr><tr><th>Free Flow Rate</th><td>12.35 CFM</td><td>6.16 CFM</td></tr><tr><th>Max Pressure</th><td>150 PSI</td><td>150 PSI</td></tr><tr><th>Duty Cycle</th><td>42% / 60 min</td><td>100%</td></tr><tr><th>Current Draw</th><td>90 A</td><td>68.6 A</td></tr><tr><th>Price</th><td>$189.99</td><td>$616.00</td></tr></table><p class=\"viewerBody\">While claims by ALL TOP are likely exaggerated, specifically the flow rate, it appeared to be a great option as long as the wiring can handle the current draw.</p><h4>System</h4><p class=\"viewerBody\">A system diagram of the current iteration of this project is shown below. The primary point of interaction between the user and the compressor is at the manifold. This is where the user plugs in an air hose and discharges the system after use. Also on the manifold is the pressure switch. From the factory, this compressor does not turn off once it has built up pressure. Adding the pressure switch ensures that the system does not become over pressurized and allows for more efficient use of the compressor's duty cycle. At this stage in the project, the compressor is turned on and off using the power switch from the factory located on the circuit board shroud. </p><img src='ProjectPics/compDiagram.png' class='diagram'><h3>Construction</h3><p class=\"viewerBody\">Assembly of this system occurred in two discrete stages. First I had to build the modified compressor assembly, then I had to mount the compressor in the engine bay.</p><h4>Compressor Assembly</h4><p class=\"viewerBody\">Aside from electrical changes, the major changes to the functionality of the air compressor were implemented on an aluminum panel that is attached to the compressor during the mounting process. This panel holds the fans and manifold.</p><div class='imagePlusCaption'><img class='projectPic' src='ProjectPics/compCon3.JPG'><p class='viewerBody viewerCaption'>Test fit of a single fan on the panel. Also visible are the aluminum rivets used to fasten the sheet aluminum used as a panel to the angle aluminum used for structure.</p></div><div class='imagePlusCaption' style='margin-bottom:20px'><img class='projectPic' src='ProjectPics/compCon2.JPG'><p class='viewerBody viewerCaption'>Overhead view of the fans mounted with the manifold next to the compressor. Also visible are the fan wires sleeved in a nylon braided sleeve to combat chaffing, and the black painted braided stainless steal airline from the compressor to the manifold.</p></div><h4>Mounting</h4><p class='viewerBody'>Before mounting, that the base the compressor usually sits on required removal because it is bulky and would require extra modification to be mounted. With the base removed, the compressor could be mounted using bolts through the holes that the base was mounted with. These bolts would go through the mounting brackets on the compressor, through both a rubber and a plastic spacer, and through the sheet metal of the engine bay into the passenger-side wheel well.</p><img src='ProjectPics/CompressorMounting.png' class='diagram'><p class='viewerBody'>The above configuration was installed on three corners of the air compressor, each with a different height plastic spacer. The different sized spacers allows the compressor to remain level with the vehicle in spite of the contours of the surface upon which the compressor is mounted. To keep the compressor mounted as low as possible, the shortest corner does not have a plastic spacer. The rubber foot provides some damping between the vibrations of the compressor and the vehicle and vice versa.</p><h3>Final Thoughts</h3><div class='imagePlusCaption'><div><p class='viewerBody'>Though incomplete, this onboard air compressor is fully functional in its current state and it works well.</p><p class='viewerBody' style='margin-bottom: 5px'>More urgent changes to be made include...</p><ul class=\"projectUl\"><li>Making a new shroud for the circuit board that accommodates the new wiring and the manifold</li><li>Stiffening the fan/manifold panel to reduce vibration noises while driving and reduce fatigue caused by movement over time</li></ul><p class='viewerBody' style='margin-bottom: 5px'>Plans for future expansions/upgrades include...</p><ul class=\"projectUl\"><li>Adding air access and a power button to the cargo area of the vehicle to make using the compressor even more convenient</li></ul></div><video width='40%' height='auto' controls class='projectPic'><source = src='ProjectPics/compRunning.mp4' type='video/mp4'></video></div>",
        "thumbnail": "compressorMounted.jpg"
    },
    "suspension": {
        "id": "suspension",
        "title": "Suspension Upgrade",
        "date" : "Summer, 2023",
        "discussion": "<p class=\"viewerBody\">Write-up coming soon...</p>",
        "thumbnail": ""
    },
    "catRewire": {
        "id": "catRewire",
        "title": "12-Volt System Rewire",
        "date" : "Summer, 2024",
        "discussion": "<p class=\"viewerBody\">Write-up coming soon...</p>",
        "thumbnail": ""
    },
    "catPopTop": {
        "id": "catPopTop",
        "title": "Pop Top Reglass",
        "date" : "Work in progress...",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": ""
    },
    "template": {
        "id": "",
        "title": "",
        "date" : "",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": ""
    }
}