{
    "compressor": {
        "id": "compressor",
        "title": "Onboard Air Compressor (WIP)",
        "date" : "Spring, 2024",
        "discussion": "<h3>Introduction</h3><p class=\"viewerBody\">Onboard air is perhaps one of the most convenient upgrades that can be done to a vehicle. From filling tires, to cleaning, blowing up inflatable toys or mattresses, and saving the day in an emergency, compressed air is great tool to have around in many situations. After finding myself in need of air more than a couple of times without a convenient way to get it, I knew this was a project I wanted to take on.</p><p class=\"viewerBody\"><i>Disclaimer: This is not a tutorial. It is only documentation of my project. Attempt similar projects at your own risk!</i></p><h3>Design</h3><p class=\"viewerBody\" style='margin-bottom: 5px'>Like most DIY projects, my general plan for building the onboard air compressor was to create a budget friendly solution of decent quality. An outline of the current design is as follows...</p><ul class=\"projectUl\"><li>Use a modified 12 Volt air compressor</li><li>Output manifold for compressor control and future air routing</li><li>Cooling fans to decrease wear and tear</li><li>Metal output hose to aid in cooling</li></ul><h4>Compressor</h4><p class=\"viewerBody\">I selected what is known as the <a href='https://www.napaonline.com/en/p/BK_MTWM10215C' target='none' class='emailLink' style='font-weight: 300'><u>NAPA air compressor</u></a> for this project. The Napa Air Compressor is an overseas-manufactured two cylinder 12-Volt air compressor that is sold under many names from many vendors with varying color schemes and features. These air compressors appear to all have the same construction and to be made in the same factory. I ultimately selected <a class='emailLink' style='font-weight: 300' target='none' href='https://www.amazon.com/ALL-TOP-Compressor-Cylinder-Portable-Inflator/dp/B0BXX761KQ'><u>one from Amazon</u></a> under the branding \"ALL TOP\" because it happened to be priced lower at the time.</p><p class=\"viewerBody\" style='margin-bottom: 10px'>Below is a comparison of the selected compressor and the industry standard <a class='emailLink' style='font-weight: 300' target='none' href='https://store.arbusa.com/twin-motor-onboard-air-compressor-ckmta12/'><u>ARB Dual Compressor</u></a>. The values are listed as advertised on the brands' websites and have not been tested.</p><table class='projectTable'><tr><th></th><th>ALL TOP</th><th>ARB</th></tr><tr><th>Free Flow Rate</th><td>12.35 CFM</td><td>6.16 CFM</td></tr><tr><th>Max Pressure</th><td>150 PSI</td><td>150 PSI</td></tr><tr><th>Duty Cycle</th><td>42% / 60 min</td><td>100%</td></tr><tr><th>Current Draw</th><td>90 A</td><td>68.6 A</td></tr><tr><th>Price</th><td>$189.99</td><td>$616.00</td></tr></table><p class=\"viewerBody\">While claims by ALL TOP are likely exaggerated, specifically the flow rate, it appeared to be a great option as long as the wiring can handle the current draw.</p><h4>System</h4><p class=\"viewerBody\">A system diagram of the current iteration of this project is shown below. The primary point of interaction between the user and the compressor is at the manifold. This is where the user plugs in an air hose and discharges the system after use. Also on the manifold is the pressure switch. From the factory, this compressor does not turn off once it has built up pressure. Adding the pressure switch ensures that the system does not become over pressurized and allows for more efficient use of the compressor's duty cycle. At this stage in the project, the compressor is turned on and off using the power switch from the factory located on the circuit board shroud. </p><img src='ProjectPics/compDiagram.png' class='diagram'><h3>Construction</h3><p class=\"viewerBody\">Assembly of this system occurred in two discrete stages. First I had to build the modified compressor assembly, then I had to mount the compressor in the engine bay.</p><h4>Compressor Assembly</h4><p class=\"viewerBody\">Aside from electrical changes, the major changes to the functionality of the air compressor were implemented on an aluminum panel that is attached to the compressor during the mounting process. This panel holds the fans and manifold.</p><div class='imagePlusCaption'><img class='projectPic' src='ProjectPics/compCon3.JPG'><p class='viewerBody viewerCaption'>Test fit of a single fan on the panel. Also visible are the aluminum rivets used to fasten the sheet aluminum used as a panel to the angle aluminum used for structure.</p></div><div class='imagePlusCaption' style='margin-bottom:20px'><img class='projectPic' src='ProjectPics/compCon2.JPG'><p class='viewerBody viewerCaption'>Overhead view of the fans mounted with the manifold next to the compressor. Also visible are the fan wires sleeved in a nylon braided sleeve to combat chaffing, and the black painted braided stainless steal airline from the compressor to the manifold.</p></div><h4>Mounting</h4><p class='viewerBody'>Before mounting, that the base the compressor usually sits on required removal because it is bulky and would require extra modification to be mounted. With the base removed, the compressor could be mounted using bolts through the holes that the base was mounted with. These bolts would go through the mounting brackets on the compressor, through both a rubber and a plastic spacer, and through the sheet metal of the engine bay into the passenger-side wheel well.</p><img src='ProjectPics/CompressorMounting.png' class='diagram'><p class='viewerBody'>The above configuration was installed on three corners of the air compressor, each with a different height plastic spacer. The different sized spacers allows the compressor to remain level with the vehicle in spite of the contours of the surface upon which the compressor is mounted. To keep the compressor mounted as low as possible, the shortest corner does not have a plastic spacer. The rubber foot provides some damping between the vibrations of the compressor and the vehicle and vice versa.</p><h3>Final Thoughts</h3><div class='imagePlusCaption'><div style='margin-right: 30px'><p class='viewerBody'>Though incomplete, this onboard air compressor is fully functional in its current state and it works well. With that said, there are changes and upgrades coming soon.</p><p class='viewerBody' style='margin-bottom: 5px'>More urgent changes to be made include...</p><ul class=\"projectUl\"><li>Making a new shroud for the circuit board that accommodates the new wiring and the manifold</li><li>Stiffening the fan/manifold panel to reduce vibration noises while driving and reduce fatigue caused by movement over time</li></ul><p class='viewerBody' style='margin-bottom: 5px'>Ideas for future expansions/upgrades include...</p><ul class=\"projectUl\" style='margin-bottom:40px'><li>Adding air access and a power button to the cargo area of the vehicle to make using the compressor even more convenient</li><li>Adding a modular/removable air tank for situations where it is known ahead of time that a lot of air will be required</li><li>Solar heated pressurized water tank for showering/cleaning</li></ul><p class='viewerBody'>To close, this project was successful in creating a valuable tool for many situations. Additionally, I learned valuable lessons in fabrication and problem solving through the construction of the fan/manifold panel, and I increased my practical understanding of structural design when developing mounting solutions for both the fan/manifold panel and the compressor itself. Overall, I am proud of the state the project is in, and I am excited to develop it further.</p></div><video width='40%' height='auto' controls class='projectPic'><source = src='ProjectPics/compRunning.mp4' type='video/mp4'></video></div>",
        "thumbnail": "compressorMounted.jpg"
    },
    "suspension": {
        "id": "suspension",
        "title": "Suspension Upgrade",
        "date" : "Summer, 2023",
        "discussion": "<h3>Introduction</h3><p class=\"viewerBody\">When I bought my 4Runner, it was on what I believed to have been its original suspension from the factory. By the time I got around to replacing the suspension in the summer of 2023, the components were likely 15 years old with 190,000 miles on them. Conventional wisdom says shock absorbers should be replaced every 50,000 to 100,000 miles, so my 4Runner was well overdue. While I was working on this project, I decided that I would switch the springs to something slightly taller because I had previous issues with bottoming out in sand and sagging while towing a boat.</p><h3>Requirements</h3><p class='viewerBody' style='margin-bottom: 5px'>The suspension on the 4Runner was upgraded to meet several goals...</p><ul class='projectUl'><li>Increase ride comfort<ul class='projectUl'><li>Reduce body roll in turns</li><li>Decrease time required to dampen a bounce</li></ul></li><li>Increase ground clearance</li><li>Decrease rear-end sag and bounce while towing</li><li>Look better</li></ul><h3>Selecting Suspension Components</h3><p class='viewerBody'>The function of individual components in the suspension system allows the selection of shocks and springs to be performed separately to a certain degree.</p><h4>Shock Absorbers</h4><p class='viewerBody'>Factory replacement shocks for this generation of 4Runners tend to be expensive relative to the performance. For this reason, the <a href='https://www.amazon.com/dp/B0BX756FJV/ref=dp_iou_view_item?ie=UTF8&th=1' target='none' class='emailLink' style='font-weight:300'><u>Bilstein 5100</u></a> set is seen as the stock replacement across the 4Runner online forums The Bilstein 5100 shocks are relatively inexpensive and perform very closely to the stock set.</p><img src='ProjectPics/rearShock.jpg' class='projectPic' style='margin-bottom:20px'><h4>Springs</h4><p class='viewerBody' style='margin-bottom: 5px'>The spring selection process was more in-depth because the decision relies on the individual use case. In this case, the vehicle is ued for...</p><ul class='projectUl'><li>Daily driving</li><li>Four-wheel-drive off-roading (mostly beach)</li><li>Light to medium weight towing</li></ul><p class='viewerBody'>Each use-case played a role in informing this decision. Regarding being a daily driver, springs more similar to the stock set would place less wear on other systems on the vehicle. Additionally, springs that lift the vehicle 3 inches or higher are less safe and necessitate the replacement of other components such as upper control arms, which would increase the cost of the project.</p> <p class='viewerBody'>In regard to off-roading, increasing the height of the springs increases the vehicle's ground clearance, so taller is better for this case. To balance these opposing use cases, a lift height limit of 2.5 inches was selected as a goldilocks zone between stock height and the 3 inch height known to cause problems.</p><p class='viewerBody'>The towing requirement can be considered independent of the height of the springs and instead can be related to the stiffness of the springs. Stiffer rear springs are better able to support a load without compressing beyond their useful length. The downside being that a stiff spring creates a more uncomfortable ride. Another angle to view this from, however, is choosing a spring long enough that with an extra load, it is still at a useful length. It can also be helpful to add airbag suspension helpers which will be discussed in greater detail later.</p><p class='viewerBody'>With those considerations listed, here are the primary candidates:<table class='projectTable'> <tr><th>Front Springs</th><th>Approximate Lift Height</th><th>Price</th></tr> <tr><td>Old Man Emu 2884</td> <td>2.5\"</td> <td>$214.00</td></tr> <tr><td>Dobinsons C59-296</td> <td>1.5\"</td> <td>$270.00</td></tr> <tr><td>Dobinsons C59-300</td> <td>2\"</td> <td>$270.00</td></tr> <tr><td>Dobinsons C59-302</td> <td>2.5\"</td> <td>$270.00</td></tr></table><img src='ProjectPics/frontStrut.jpg' class='projectPic' style='margin-bottom:20px'><p class='viewerBody'>Through research, I determined that I trusted the quality of Dobinsons springs slightly more than Old Man Emu. Additionally I decided that a 2 inch lift was appropriate for my situation as my 4Runner is much more of a daily driver than an off-roader. As such, I selected the Dobinsons C59-300 for the front springs.</p> <table class='projectTable'> <tr><th>Rear Springs</th><th>Approximate Lift Height</th><th>Price</th></tr>  <tr><td>Old Man Emu 2895</td> <td>2\"</td> <td>$214.00</td></tr> <tr><td>Dobinsons C59-599</td> <td>1\"</td> <td>$270.00</td></tr> <tr><td>Dobinsons C59-505</td> <td>1.5\"</td> <td>$270.00</td></tr> <tr><td>Dobinsons C59-325</td> <td>2\"</td> <td>$270.00</td></tr></table><img src='ProjectPics/rearSpring.jpg' class='projectPic' style='margin-bottom:20px'><p class='viewerBody'>It is commonplace to lift the rear of a vehicle less than the front because most vehicles come with forward rake from the factory. To level the vehicle a 1 inch lift or less would likely be appropriate here; however, in this case I selected the 1.5 inch Dobinsons C59-505 spring in the rear to reduce sag while towing.</p><p class='viewerBody'>In addition to the rear springs, I purchased <a target='none' class='emailLink' style='font-weight: 300' href='https://a.co/d/3wKYJkn'><u>Firestone Coil Rite Air Helper Springs</u></a>. These airbags can be inflated via any source of compressed air such as a bicycle pump or an air compressor, and they can greatly reduce loading on the rear springs.</p><h3>Installation</h3><p class='viewerBody'>The seller where the springs and front shocks were purchased from would build the front strut assembly for an extra $190. Without access to a spring compressor and no experience using one, I felt it was safer to use this offer. I completed the rest of the installation with the help of my father in our driveway.</p><p class='viewerBody'>To complete the installation we worked using YouTube videos as guides. We found the most difficult task to be removing the front struts from the steering knuckles; however, with heat and persuasion we were able to move on.<h3>Final Thoughts</h3><p class='viewerBody'>Overall, this project was successful in achieving each of the laid out requirements. The handling of the 4Runner benefited greatly from the reduced body roll in turns, bottoming out in deep sand is much less common, it handles trailers very well, and it looks a little bit better while doing all of these things.</p>",
        "thumbnail": "susThumb.jpg"
    },
    "catRewire": {
        "id": "catRewire",
        "title": "12-Volt System Rewire",
        "date" : "Summer, 2024",
        "discussion": "        <h3>Introduction</h3>        <p class='viewerBody'>After sailing home, one of the most glaring issues with the boat was the electrical system. The less than stellar design of the system from the factory combined with years of patchwork by multiple owners left a recipe for disaster.</p>        <p class='viewerBody'>Fortunately, I love doing 12 Volt electrical work, so this was a great first step to take on in the restoration of my Catalina 22.</p>        <h3>Initial Problems</h3>        <p class='viewerBody'>There were several issues with the electrical system upon acquisition of the boat:</p>        <ul class='projectUl'>            <li><b>Open wiring</b> - Wires (possibly powered) not connected to anything can lead to shorts and fires</li>            <li><b>Wire nuts</b> - Unacceptable in a marine environment due to the lack of corrosion protection and general impermanence</li>            <li><b>General Disorganization</b> - Makes maintenance and troubleshooting difficult</li>            <li><b>Components not connected</b> - Several components such as cabin lights, the anchor light, and compass backlight not connected to the system</li>        </ul>        <h3>New System Design</h3>        <p class='viewerBody' style='margin-bottom:5px'>A diagram of the new electrical system is shown and discussed below.</p>        <h4 style='margin-bottom:5px'><b>Key Points</b></h4>        <ul class='projectUl'>            <li>Power for each component originates at the Main Fuse Panel such that the entire system is fused</li>            <li>The bilge pump and radio memory have power regardless of the position of the main power switch on the Main Switch Panel</li>            <li>Each component off of the Main Switch Panel is fused again. This is also true true with the subsequent Mast Lights Switch Panel</li>            <li>Each component grounds to the ground bus bar which is connected directly to the battery</li>            <li>Not shown is a removable small trickle charging solar panel</li>        </ul>        <img src='ProjectPics/CatalinaDiagram.png' class='diagram'>        <h3>Implementation</h3>        <p class='viewerBody' style='margin-bottom:5px;'>The primary goals of building this system were to ensure that it is safe and reliable. To obtain this, the following guidelines were used.</p>        <ul class='projectUl'>            <li>Oversized wires used relative to fuses and devices.</li>            <li>Each connection is crimped and protected with heat shrink<br>(some have double heat shrink because most of the crimp connectors used have a heat shrink coating)</li>            <li>Very small gauge wire is soldered instead of crimped (rare)</li>            <li>Wires are kept as high as possible within the space they are located</li>            <li>Follow <a href='https://www.clrmarine.com/538.html?srsltid=AfmBOorpWszdiiaz7wocrYct_JglKHNQBu24bhia4mi_0Fv9fLjz0YIx' target='none' class='emailLink' style='font-weight:200;'><u>ABYC wire-color standards</u></a> where practical</li>        </ul>        <h4>Challenges</h4>        <p class='viewerBody' style='margin-bottom:5px'>Two primary challenges were presented during this implementation:</p>        <ul class='projectUl'>            <li>                The boat was not designed or constructed with modern wiring standards/practices in consideration. For example:                <ul class='projectUl'>                    <li>Wire-runs sandwiched between fiberglass components are impossible to maintain or replace</li>                    <li>General lack of built in wire conduit and organization devices</li>                    <li>No existing system for fusing devices receiving constant power</li>                    <li>Not enough switches to control necessary navigational lighting</li>                    <li>No allocated space to implement the aforementioned systems</li>                </ul>            </li>            <li>It is financially impractical to completely replace each length of wire and component</li>        </ul>        <p class='viewerBody' style='margin-bottom:5px'>Overcoming these challenges required compromises in the aesthetics and organization of the system, but also clever solutions. For example:</p>        <ul class='projectUl'>            <li>Wire lengths result in unsightly routes away from fuse panels and the bus bar</li>            <li>Separate locations of the fuse panel board and switch panel result in complicated wire routes</li>            <li>A backing board for mounting the fuse panels was installed using 3M 4200 semi-permanent marine adhesive. Modern vessels likely have something similar already installed made from PVC board or a glassed in wooden backer board</li>            <li>A separate temporary mast light switch panel for use until further improvements can be made</li>        </ul>        <div class='imagePlusCaption'>            <img src='ProjectPics/wire1.jpg' class='projectPic'>            <p class='viewerCaption'>Fuse board with the Accessory Fuse Panel on top, Main Fuse Panel in the middle, and Ground Bus Bar on the bottom.</p>        </div>        <div class='imagePlusCaption'>            <img src='ProjectPics/mastSwitch.jpg' class='projectPic'>            <p class='viewerCaption'>Mast Lights Switch Panel with switches for the anchor light, deck light, and steaming light in order from left to right.</p>        </div>        <h3>Next Steps</h3>        <p class='viewerBody' style='margin-bottom: 5px'>In its current state the system works well; however, I would like to make improvements in the near future.</p>        <ul class='projectUl'>            <li>Addition of VHF radio, likely built into a panel with mast light switches and USB charging ports</li>            <li>Reorganize how wires are zip-tied together</li>            <li>Connect a spare cabin light that the previous owner left</li>            <li>Clean/refresh the on/off indicators on the Main Switch Panel</li>        </ul>",        "thumbnail": "mainPanel.jpg"
    },
    "rigging": {
        "id": "rigging",
        "title": "Rigging Upgrades (WIP)",
        "date" : "Summer-Fall, 2024",
        "discussion": "<h3>Introduction</h3>        <p>Rigging is everything on a sailboat. It factors into the performance of the boat as well as conformability. In my discussions with the previous owner, I was pleased to learn that the standing rigging had been replaced recently along with a few pieces of running rigging such as the mainsheet and halyards. Despite this, there was still much to address in regard to rigging.</p>        <h3>Headsail Downhaul/Spinnaker Tack-Line</h3>        <p>Inspired by <a class='emailLink' style='font-weight:200' target='none' href='https://stingysailor.com/2023/03/25/headsail-downhaul-solution-2/'><u>The Stingy Sailor</u></a>, my first addition to the rigging of this boat was a double-duty headsail downhaul (white line with red tracer below).</p>        <img style='margin-bottom:20px; border-radius:5px; width:60%; max-width:600px; height:auto;' src='../ProjectPics/bowPic.jpg'>        <h4>Outline</h4>        <p style='margin-bottom:5px;'>The purpose of this line is to allow a jib/genoa to be pulled down from the cockpit. This is helpful in a couple of ways:</p>        <ul class='projectUl'>            <li>Easier singlehand sailing</li>            <li>Crew does not have to go forward to reduce sail (especially handy in heavy conditions)</li>        </ul>        <p>In addition to these benefits as a downhaul, the system can work as an adjustable tack-line for a spinnaker sail.</p>        <h4>Function</h4>        <p>The downhaul is run through a turning block shackled to the stem fitting and the lead aft to the cockpit through fairleads, where it terminates in a jam cleat.</p>        <p style='margin-bottom:5px;'>To douse a sail with the downhaul...</p>        <ul class='projectUl'>            <li>Turn the bow into the wind</li>            <li>Release the headsail halyard</li>            <li>Keeping slight tension on the halyard, pull the downhaul through the cleat</li>            <li>When conditions allow, contain/stow the headsail</li>        </ul>        <p style='margin-bottom:5px;'>To hoist a sail with the downhaul...</p>        <ul class='projectUl'>            <li>Turn the bow into the wind</li>            <li>Coil the downhaul such that it can feed through its cleat</li>            <li>Uncleat the downhaul</li>            <li>Hoist the headsail with the halyard as usual</li>            <li>Take most of the slack out of downhaul; do not pull tight</li>        </ul>        <h4>Future Improvements</h4>        <p style='margin-bottom:5px;'>After using this system many times, there are a few improvements to be made:</p>        <ul class='projectUl'>            <li>Relocate turning block to reduce clutter and allow for Catalina Direct Anchor Roller</li>            <li>Replace jam cleat with a cam cleat to make hosting easier</li>            <li>Add a fairlead to reduce gelcoat wear at a specific point</li>        </ul>        <h3>Other Rigging Upgrades</h3>        <p>There are other rigging upgrades in progress. Check back later to see the results! In the meantime, <a href='../blog.html#mainsheetControlsBlog'><u>updates will be posted on my blog.</u></a></p>",
        "thumbnail": "starBlocks.jpg"
    },
    "catPopTop": {
        "id": "catPopTop",
        "title": "Pop Top Re-glass (WIP)",
        "date" : "Work in progress...",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": "slidingTop.jpg"
    },
    "topSideRefresh": {
        "id": "topSideRefresh",
        "title": "Top Side Refresh (WIP)",
        "date" : "Summer, 2024",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": "cribBoards.jpg"
    },
    "template": {
        "id": "",
        "title": "",
        "date" : "",
        "discussion": "<p class=\"viewerBody\"></p>",
        "thumbnail": ""
    }
}